app/controllers/api/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 3)
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "lc@headerlabs.com"], ["first_name", "LC"], ["last_name", "LC"], ["created_at", "2020-11-27 18:11:28.636004"], ["updated_at", "2020-11-27 18:11:28.636004"]]

  def search
    @users = User.where("lower(email) LIKE :search OR lower(first_name) LIKE :search OR lower(last_name) LIKE :search", search: "#{params[:input].downcase}%",  search: "#{params[:input].downcase}%",  search: "#{params[:input].downcase}%")
---
SELECT "users".* FROM "users" WHERE (lower(email) LIKE 'iss%' OR lower(first_name) LIKE 'iss%' OR lower(last_name) LIKE 'iss%' OR)

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]